<HTML>
<!-- CREATION DATE: 12.04.2007 -->
<HEAD>
<TITLE>ClickOff Kurzanleitung</TITLE>
<META NAME="Description" CONTENT="">
<META NAME="Keywords" CONTENT="">
<META NAME="Author" CONTENT="Johannes Huebner">
<META NAME="Generator" CONTENT="AceExpert">
</HEAD>
<BODY>
<h1>&Uuml;bliche Szenarien</h1>
<h2>Einen Button automatisch klicken lassen</h2>
Wenn das Fenster mit dem zu klickenden Button auf dem Bildschirm erscheint, einfach mit der Maus auf den Button zeigen und dann die Tastenkombination zum hinzuf&uuml;gen dr&uuml;cken (Standard: Strg+Alt+D). Dieses Verfahren funktioniert auch f&uuml;r Auswahlk&auml;stchen (H&auml;kchen) und Optionsfelder (Kreise).

<h2>Ein Fenster automatisch schlie&szlig;en lassen</h2>
Wenn das Fenster auf dem Bildschirm ist, oben auf die Titelleiste zeigen und dann die Tastenkombination zum hinzuf&uuml;gen dr&uuml;cken (Standard: Strg+Alt+D).

<h2>Ein Eingabefeld automatisch ausf&uuml;llen lassen</h2>
Wenn das Eingabefeld auf dem Bildschirm ist, mit einem Doppelklick auf das ClickOff-Icon die ClickOff-Liste &ouml;ffnen. Dann auf das Feld zeigen und die Tastenkombination zum hinzuf&uuml;gen dr&uuml;cken (Standard: Strg+Alt+D). Den neuen Eintrag (wird unten an der Liste angef&uuml;gt) durch einen Doppelklick bearbeiten und unter <i>Ausf&uuml;llen:</i> den einzugebenden Text festlegen.<br>
<b>Diese Funktion sollte nicht zum eingeben von Passw&ouml;rtern benutzt werden, da die Daten unverschl&uuml;sselt gespeichert werden!</b>

<h1>Probleme</h1>
<h2>Ein Button wird nicht gedr&uuml;ckt/Feld nicht ausgef&uuml;llt</h2>
M&ouml;gliche Ursachen:
<ol>
<li>Der Button/das Textfeld ist stammt nicht aus der Standardbibliothek von Windows sondern ist eine Eigenkreation (z.B. bei Firefox)<br>
<b>L&ouml;sung:</b> Seit Version 1.83 kann ClickOff einfach an eine bestimmte Stelle innerhalb eines Fensters klicken. Entsprechende Buttons werden beim erkennen mit dieser Einstellung hinzugef&uuml;gt. Die Funktion ist aber <b>mit Vorsicht zu genieﬂen:</b> in jedem anderen Fenster, das den gleichen Titel hat, klickt ClickOff an die selbe Stelle! Das kann nat&uuml;rlich unerw&uuml;nschte Auswirkungen haben.

<li>Der Button wird von einem ihn umgebenden Rahmen unsichtbar &uuml;berlagert. ClickOff erkennt dann statt dem Button den Rahmen, welcher sich nat&uuml;rlich nicht anklicken l&auml;sst.<br>
<b>L&ouml;sung:</b> Die Beschriftung des Buttons von Hand eintragen. Dabei ist zu beachten, dass der unterstrichene Buchstabe auf dem Button mit einem <i>&</i> erzeugt wird. Also z.B. f&uuml;r <i>A<u>b</u>brechen</i> ist <i>A&bbrechen</i> einzutragen.
</ol>

<h1>H&auml;ufige Fragen</h1>
<ol>
<li><b>Q:</b> L&auml;uft ClickOff auf Vista/7<br>
<b>A:</b> Ich wei&szlig; es nicht, da ich selbst nur Windows XP benutze. Probieren geht &uuml;ber studieren, es kann nichts kaputt gehen.

<li><b>F:</b> Wo ist der Assistent?<br>
<b>A:</b> Da man Fenster und Buttons nun per Tastenkombination hinzuf&uuml;gen kann, war der Assistent &uuml;berfl&uuml;ssig geworden und ich habe ihn zwecks &Uuml;bersichtlichkeit entfernt.

<li><b>F:</b> Auf dem "Erweitert"-Dialog gabs mal einen Button "Text erkennen". Wo ist der hin und wie kann ich ohne ihn den Text neu erkennen?<br>
<b>A:</b> Der wurde genauso &uuml;berfl&uuml;ssig, nun zeigt man einfach auf den Text, den man erkennen will und dr&uuml;ckt die eingestellte Tastenkombination - fertig!

<li><b>F:</b> Wohin ist die Listendatei verschwunden?<br>
<b>A:</b> Daf&uuml;r gibt es jetzt 3 verschiedene Orte, man entscheidet bei der Installation. Entweder liegt sie im pers&ouml;nlichen Programmdatenverzeichnis (Standard: c:\dokumente und einstellungen\(name)\Anwendungsdaten\clickoff)oder im globalen (Standard: c:\dokumente und einstellungen\All Users\Anwendungsdaten\clickoff). Ist die Datei an keinem der beiden Orte, so sucht ClickOff im Startverzeichnis (Standard: c:\programme\clickoff).

<li><b>F:</b> ClickOff st&uuml;rzt ab/startet nicht!<br>
<b>A:</b> Das ist meistens ein Fehler in der Listen- oder Konfigurationsdatei. Bei einem Hilferuf von daher immer diese beiden Dateien anh&auml;ngen (wo sie sich finden steht oben).
</ol>
</BODY>
</HTML>
